const qBank = [
  {    
      id: 3,
      label: "A1",
      questionTitle:
        " Είμαι εγγεγραμμένος/η άνεργος/η στον ΟΑΕΔ με κάρτα ανεργίας σε ισχύ (συμπεριλαμβάνονται και οι εποχικά εργαζόμενοι για το διάστημα που δεν εργάζονται;",
      subQuestions: [
        {
          subId: 4,
          subLabel:"A1.1",
          subTitle:
            "A1.1 Είμαι 25 ετών και άνω και εγγεγραμμένος/η άνεργος/η στον ΟΑΕΔ με κάρτα ανεργίας σε ισχύ και διάστημα  ανεργίας πάνω από δώδεκα (12) συνεχείς μήνες ; (>12 μήνες)",
        },
        {
          subId: 5,
          subLabel:"A1.2",
          subTitle:
            "A1.2 Είμαι κάτω των 25 ετών και εγγεγραμμένος/η άνεργος/η στον ΟΑΕΔ με κάρτα ανεργίας σε ισχύ και διάστημα  ανεργίας πάνω από έξι (6) συνεχείς μήνες; (> 6 μήνες)",
        },
      ]
  },
  {
      id: 6,
      label: "A2",
      questionTitle: " Είμαι εργαζόμενος ",
      subQuestions: [
        {
            subId: 7,
            subLabel:"A2.0",
          subTitle: "A2.0 Απασχολούμαι στον ιδιωτικό τομέα :",
        },
        {
            subId: 8,
            subLabel:"A2.1.1",
          subTitle:
            "A2.1.1 Απασχολούμαι με σύμβαση εργασίας πλήρους απασχόλησης  και   αορίστου χρόνου",
        },
        {
            subId: 9,
            subLabel:" A2.1.2",
          subTitle:
            "A2.1.2 Απασχολούμαι με σύμβαση εργασίας πλήρους απασχόλησης και ορισμένου χρόνου (συμπεριλαμβάνεται η εποχική απασχόληση)",
        },
        {
            subId: 10,
            subLabel:" A2.1.3",
          subTitle:
            "A2.1.3 Απασχολούμαι με σύμβαση εργασίας μερικής απασχόλησης και αορίστου χρόνου",
        },
        {
            subId: 11,
            subLabel:" A2.1.4",
          subTitle:
            "A2.1.4 Απασχολούμαι με σύμβαση εργασίας μερικής απασχόλησης και ορισμένου χρόνου (συμπεριλαμβάνεται η εποχική απασχόληση)",
        },
        {
            subId: 12,
            subLabel:" A2.1.5",
          subTitle: "A2.1.5 Απασχολούμαι με εκ περιτροπής απασχόληση ",
        },
        { subId: 13,label:" A2.1.6", subTitle: "A2.1.6 Απασχολούμαι αμειβόμενος/η με εργόσημο" },
      ],
    }
];

const questionApi = Promise.resolve(qBank);

export default questionApi ;

//     {label:"A2",  , },
//     {label:"A22", id: 14 , title:"A2.2 Απασχολούμαι στο δημόσιο τομέα (ΝΠΔΔ και ΝΠΙΔ)"},
//     {label:"A23", id:18 , title:"A2.3 Είμαι αυτοαπασχολούμενος/η"},
//     {label:"A23", id:20 , title:"A3 Δεν ανήκω σε καμία από τις παραπάνω κατηγορίες (Δεν είμαι ούτε εγγεγραμμένος άνεργος στον ΟΑΕΔ ούτε εργαζόμενος/αυτοαπασχολούμενος)"}

// }
